app/controllers/nbaplayers_controller.rb

SELECT "nbaplayers".* FROM "nbaplayers"
---
  def index
    @nbaplayers = Nbaplayer.all

INSERT INTO "nbaplayers" ("name", "position", "team", "avgpoints", "is_starting_lineup", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "sdf"], ["position", "sdf"], ["team", "sdf"], ["avgpoints", 1], ["is_starting_lineup", "t"], ["created_at", "2015-04-01 01:36:38.064719"], ["updated_at", "2015-04-01 01:36:38.064719"]]
---
  def create
    @nbaplayer = Nbaplayer.new(nbaplayer_params)
    respond_to do |format|
      if @nbaplayer.save

DELETE FROM "nbaplayers" WHERE "nbaplayers"."id" = ?  [["id", 2]]
---
  def destroy
    @nbaplayer.destroy

SELECT  "nbaplayers".* FROM "nbaplayers" WHERE "nbaplayers"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_nbaplayer
      @nbaplayer = Nbaplayer.find(params[:id])