app/controllers/nbaplayers_controller.rb

  def list
    @nbaplayers = Nbaplayer.all
---
SELECT "nbaplayers".* FROM "nbaplayers"